app/controllers/users_controller.rb

SELECT "microposts".* FROM "microposts"
---
	def show
		@microposts = Micropost.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "anhtt"], ["email", "anhtt@gmail.com"], ["created_at", 2016-09-08 16:17:41 UTC], ["updated_at", 2016-09-08 16:17:41 UTC]]
---
	def create
		@user = User.new(user_params)

		respond_to do |format|
			if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "tuananh@gmail.com.vn"], ["updated_at", 2016-09-09 16:13:13 UTC], ["id", 6]]
---
	def update
		respond_to do |format|
			if @user.update(user_params)